1. 表示、変数、演算
練習問題 1 - 1
“Hello World”と表示するプログラムを作成しなさい。

※ 	System.out.println()、System.out.print()、System.out.printf()などを使用する。
練習問題 1 - 2
int 型の変数 x に数値 11 を代入し、x の値を“x=11”のように表示するプログラムを作成しなさい。

練習問題 1 - 3
int 型の変数 x、y に数値 13、17 を代入し、x、y の値を“x=13,y=17”のように表示するプログラムを作成しなさい。

練習問題 1 - 4
int 型の変数 x に数値 13 と 17 の和を代入し、x の値を表示するプログラムを作成しなさい。

練習問題 1 - 5
数値 13 と 17 の積を表示するプログラムを作成しなさい。ただし、変数を使用しないこと。

※ 	System.out.println()の引数部分で演算を行う。
練習問題 1 - 6
次のプログラムを作成しなさい。

int 型の変数 x に数値 7 を代入する。
変数 x の値を 3 倍にする。
変数 x の値を表示する。
変数 x の値を半分（1/2）にする。
変数 x の値を表示する。
練習問題 1 - 7
int 型の変数 x、y に任意の数値を代入し、x の値を y に、y の値を x に入れ替えて x と y の値を表示するプログラムを作成しなさい。

※ 	xとy以外に、もうひとつ変数が必要となる。
x = 3;
y = 7;

// ここでxとyの値を入れ替える

System.out.println( "x=" + x + ",y=" + y );
練習問題 1 - 8
int 型の変数 x、y に数値 19、23 を代入し、その積を変数 z に代入して z の値を表示するプログラムを作成しなさい。

練習問題 1 - 9
int 型の変数 x に任意の数値を代入し、x を 2 倍、3 倍、4 倍した結果を表示するプログラムを作成しなさい。

練習問題 1 - 10
int 型の変数 x に任意の数値を代入し、x を 1 乗、2 乗、3 乗した結果を表示するプログラムを作成しなさい。

練習問題 1 - 11
int 型の変数 x に任意の数値を代入し、x を x より小さい任意の数値で割った商と余りを表示するプログラムを作成しなさい。

練習問題 1 - 12
int 型の変数 x に任意の数値を代入し、インクリメント演算子、デクリメント演算子を適用して結果を表示することにより演算子の効果を確認するプログラムを作成しなさい。